astb_relise/src/Documents/Уведомление/Уведомление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Уведомление</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстУведомления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУведомления</name>
    <type>
      <types>EnumRef.ВидыУведомлений</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

astb_relise/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияСИЗ</name>
    <type>
      <types>CatalogRef.МестаХраненияСИЗСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемаДляЛичнойКарточки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

astb_relise/src/CommonModules/ОтправкаPUSHВызовСервера/Module.bsl
//процедура выполняет отправку push-уведомления
//
//параметры:
// Уведомление - объект, типа "ДоставляемоеУведомление"
// Пользователь - получатель уведомления (физическое лицо)
//
Процедура ОтправитьУведомление(Уведомление, Пользователь, ВидУведомления) Экспорт
	
	Если Пользователь.ИдентификаторПодписчикаДоставляемыхУведомлений <> Неопределено Тогда
		Идентификатор = Пользователь.ИдентификаторПодписчикаДоставляемыхУведомлений.Получить();
		Если Идентификатор <> Неопределено Тогда
			Уведомление.Получатели.Добавить(Идентификатор);
			СформироватьДокументУведомления(Пользователь,Уведомление.Текст,ВидУведомления);
		КонецЕсли;
	КонецЕсли;
	
	Если Уведомление.Получатели.Количество() > 0 Тогда
		
		ДанныеАутентификации = СокрЛП(Константы.КлючДоступаОтправителяУведомлений.Получить());
			
		УдаленныеТокены = Новый Массив;
		ОтправкаДоставляемыхУведомлений.Отправить(Уведомление, ДанныеАутентификации, УдаленныеТокены, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДокументУведомления(ФизическоеЛицо,ТекстУведомления,ВидУведомления)
	
	Сотрудник = Справочники.Сотрудники.НайтиПоРеквизиту("ФизическоеЛицо",ФизическоеЛицо);
	
	Если Сотрудник.Пустая() Тогда
		Возврат;
	КонецЕсли;	
	
	НовыйДокумент = Документы.Уведомление.СоздатьДокумент();
	НовыйДокумент.Дата				= ТекущаяДата();
	НовыйДокумент.ВидУведомления 	= ВидУведомления;
	НовыйДокумент.Организация 		= Сотрудник.Владелец;
	НовыйДокумент.Отправлено 		= Истина;
	НовыйДокумент.Сотрудник 		= Сотрудник;
	НовыйДокумент.ТекстУведомления 	= ТекстУведомления;
	НовыйДокумент.УстановитьНовыйНомер();
	НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
	
КонецПроцедуры	

//функция определяет возможность отправки уведомлений
//
//параметры: 
// Пользователь - элемент справочника внешние пользователи
//
Функция МожноОтправлятьУведомления(Пользователь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Константы.КлючДоступаОтправителяУведомлений.Получить()) Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	//уведомления отправляются только авторизованным внешним пользователям
	Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда
		Если НЕ ЗначениеЗаполнено(Пользователь.ОбъектАвторизации) Тогда
			Возврат Ложь;		
		КонецЕсли;
		Если Пользователь.ПометкаУдаления Тогда
			Возврат Ложь;		
		КонецЕсли;
		Если Пользователь.Недействителен Тогда
			Возврат Ложь;		
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	ФизическоеЛицо = Пользователь.ОбъектАвторизации;
	
	//пользователь уже дожен был подключаться к базе
	Если НЕ ФизическоеЛицо.ИдентификаторПодписчикаДоставляемыхУведомлений = Неопределено Тогда
		Идентификатор = ФизическоеЛицо.ИдентификаторПодписчикаДоставляемыхУведомлений.Получить();
		Если НЕ Идентификатор = Неопределено Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции
